Revit 2024 API
BuiltInFailures.CurveByPointFailures.UnableToGenerateCurve Property
 Unable to generate valid curve geometry from the driving points. The line by points will be dissolved.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId UnableToGenerateCurve { get; }
Visual Basic
Public Shared ReadOnly Property UnableToGenerateCurve As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ UnableToGenerateCurve {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.CurveByPointFailures Class
Autodesk.Revit.DB Namespace